[Killed] ObjectLiteral
Jest/challenge-3/src/exercise1.js:1:19
-const exercise1 = {
-    method1: () => {
-        return 1;
-    },
-
-    method2: () => {
-        return 2;
-    },
-
-    method3: (x) => {
-        if (x) {
-            return exercise1.method1();
-        } else {
-            return exercise1.method2();
-        } 
-    },
-}
+const exercise1 = {}
 
 module.exports = exercise1;

[Killed] BlockStatement
Jest/challenge-3/src/exercise1.js:2:20
 const exercise1 = {
-    method1: () => {
-        return 1;
-    },
+    method1: () => {},
 
     method2: () => {

[Killed] BlockStatement
Jest/challenge-3/src/exercise1.js:6:20
         return 1;
     },
 
-    method2: () => {
-        return 2;
-    },
+    method2: () => {},
 
     method3: (x) => {

[Killed] BlockStatement
Jest/challenge-3/src/exercise1.js:10:21
         return 2;
     },
 
-    method3: (x) => {
-        if (x) {
-            return exercise1.method1();
-        } else {
-            return exercise1.method2();
-        } 
-    },
+    method3: (x) => {},
 }
 

[Killed] ConditionalExpression
Jest/challenge-3/src/exercise1.js:11:13
     },
 
     method3: (x) => {
-        if (x) {
+        if (false) {
             return exercise1.method1();
         } else {

[Killed] BlockStatement
Jest/challenge-3/src/exercise1.js:11:16
     },
 
     method3: (x) => {
-        if (x) {
-            return exercise1.method1();
-        } else {
+        if (x) {} else {
             return exercise1.method2();
         } 

[Killed] BlockStatement
Jest/challenge-3/src/exercise1.js:13:16
     method3: (x) => {
         if (x) {
             return exercise1.method1();
-        } else {
-            return exercise1.method2();
-        } 
+        } else {} 
     },
 }
