[Killed] BlockStatement
Jest/challenge-3/src/exercise2.js:2:23
 const exercise2 = {
-    isNumber2: (x) => {
-        return 2 === x;
-    },
+    isNumber2: (x) => {},
 
     mainMethod: (x) => {

[Killed] ConditionalExpression
Jest/challenge-3/src/exercise2.js:3:16
 const exercise2 = {
     isNumber2: (x) => {
-        return 2 === x;
+        return true;
     },
 

[Killed] EqualityOperator
Jest/challenge-3/src/exercise2.js:3:16
 const exercise2 = {
     isNumber2: (x) => {
-        return 2 === x;
+        return 2 !== x;
     },
 

[Killed] BlockStatement
Jest/challenge-3/src/exercise2.js:6:24
         return 2 === x;
     },
 
-    mainMethod: (x) => {
-        return exercise2.isNumber2(3)
-    },
+    mainMethod: (x) => {},
 }
 
